const prompt = require("prompt-sync")();

let name = prompt("กรุณาใส่ชื่อของคุณ: ");
let birthYear;

while (true) {
  birthYear = prompt("กรุณาใส่ปีเกิด (ค.ศ.): ");

  if (!isNaN(birthYear) && birthYear.trim() !== "") {
    break; // ออกจากลูปเมื่อค่าถูกต้อง
  }

  console.log("กรุณาใส่ปีเกิดเป็นตัวเลขเท่านั้นนะ");
}
let currentYear = new Date().getFullYear();
let age = currentYear - Number(birthYear);
console.log("สวัสดีคุณ " + name + " 👋");
console.log("ปีนี้คุณอายุประมาณ " + age + " ปี");
console.log("ยินดีต้อนรับเข้าสู่โปรแกรมที่ดีที่สุด");
